In [1]:
import sqlite3

In [2]:
connection = sqlite3.connect('example.db')

In [3]:
cursor = connection.cursor()

# Create a table
cursor.execute('''
CREATE TABLE IF NOT EXISTS users (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER NOT NULL,
    department TEXT
)
''')

In [4]:
connection.commit()

In [5]:
cursor.execute('''
               SeLECT * FROM users
               ''')

In [6]:
cursor.execute('''
INSERT INTO users (name, age, department) VALUES
('Alice', 30, 'HR'),
('Bob', 25, 'Engineering'),
('Charlie', 35, 'Marketing')
''')

In [7]:
connection.commit()

In [8]:
cursor.execute('''
SELECT * FROM users
''')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 30, 'HR')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Marketing')

In [9]:
cursor.execute('''
UPDATE users
SET age = 31
WHERE name = 'Alice'
''')
connection.commit()

In [ ]:
cursor.execute(
    """
SELECT * FROM users
"""
)
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 31, 'HR')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Marketing')

In [12]:
cursor.execute(
    """
               DELETE FROM users
               WHERE name = 'Bob'
"""
)

connection.commit()

In [ ]:
cursor.execute(
    """
               SELECT * FROM users
               """
)
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 31, 'HR')
(3, 'Charlie', 35, 'Marketing')

In [14]:
connection.close()